from aiogram import Router
from aiogram.filters import CommandStart
from aiogram.types import Message
from aiogram.fsm.context import FSMContext

from states import UserState

router = Router()

@router.message(CommandStart())
async def cmd_start(message: Message, state: FSMContext):
    
    await state.set_state(UserState.interest)
    
    await message.answer(
        "Привет! Я твой AI-помощник для прогулок по Нижнему Новгороду — «Гуляй-НН» 🚶‍♂️✨\n"
        "Я помогу тебе составить идеальный маршрут, основанный на твоих интересах.\n"
        "Чтобы начать, ответь, пожалуйста, на 3 простых вопроса.\n\n"
        "Вопрос 1 из 3:\n"
        "Чем ты увлекаешься? Что хотел бы посмотреть? Перечисли свои интересы через запятую.\n"
        "Например: стрит-арт, история, кофейни, панорамные виды, современное искусство, старинная архитектура, книжные магазины."
    )